In [1]:
import pandas as pd
import numpy as np

In [59]:
drinks = pd.read_csv('drinks.csv')

In [60]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [ ]:
# Select columns by name
drinks[['beer_servings','continent']]

In [ ]:
# Select columns with .loc. All rows for Continent
drinks.loc[:,'continent']

In [ ]:
# same but two columns and all rows
drinks.loc[:,['continent','beer_servings']]

In [ ]:
# everything for country Angola
drinks.loc[drinks['country']=='Angola',:]

In [ ]:
# only wine servings in Angola
drinks.loc[drinks['country']=='Angola', ['country','wine_servings']]

In [ ]:
# all countries where wine_servings > 45
drinks['country'].loc[drinks['wine_servings']>145]

In [ ]:
# all countries and continents, and servings where wine_servings > 145
drinks[['country','continent','wine_servings']].loc[drinks['wine_servings']>145]

In [ ]:
#select all even rows
drinks.iloc[::2,:]

In [ ]:
# select all odd columns
drinks.iloc[:,::2]

In [ ]:
# select the last column without using the name
drinks.iloc[:,-1:]

In [ ]:
# select all but the last column without using the name
drinks.iloc[:,:-1]

In [72]:
# Rename a column in place
# drinks = drinks.rename({'country':'Country'}, axis = 0, inplace = True)

In [74]:
drinks.rename(columns={"country":"Country"}, inplace = True)

In [78]:
drinks.columns

Index(['Country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [88]:
# Selecting everything for a given list of countries
drinks[drinks['Country'].isin(['Algeria','Spain','Canada'])]

,Country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
2,Algeria,25,0,14,0.7,Africa
32,Canada,240,122,100,8.2,North America
160,Spain,284,157,112,10.0,Europe

In [ ]:
# select columns by data type
drinks.dtypes

In [ ]:
# select first 15 rows
drinks.iloc[:15,:]

In [ ]:
#let's select float64
drinks.select_dtypes(include='float64')

In [ ]:
# let's exclude objects
drinks.select_dtypes(exclude = 'object')

In [ ]:
# For continent: change its type object to type category (saves space)
dtypes ={'continent':'category'}
drinks.astype(dtype = dtypes).dtypes

In [ ]:
# dealing with nans, % of nans in a column, split a string, pivot tables, correlation heatmap, aggregate functions (agg, mean(), group by)
# https://www.youtube.com/watch?v=RlIiVeig3hc
# https://www.youtube.com/watch?v=dPwLlJkSHLo